
print("Hello world")

# Задача : написать дерево бинарного поиска , продемонстрировать вставку , удаление и обход